# IsSwitchboardSchedule Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleTemplate..::..IsSwitchboardSchedule Property
PanelScheduleTemplate Class See Also
---
Checks to see if this object is switchboard schedule template element.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsSwitchboardSchedule { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsSwitchboardSchedule As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsSwitchboardSchedule {
	bool get ();
}
```

# See Also
PanelScheduleTemplate Class
Autodesk.Revit.DB.Electrical Namespace